app/views/ablums/show.html.erb


    <% @ablum.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."ablum_id" = ?  [["ablum_id", 1]]