app/controllers/api/v1/post_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index


    @posts =  current_user.posts.paginate(:page => params[:page])

SELECT  "users".* FROM "users"  WHERE "users"."authentication_token" = '75567329f0e9228111e887e15e2f5a35' LIMIT 1
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["user_id", 3]]
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  def info




    user=User.find_by_authentication_token(params[:auth_token])


    if user


      @posts =  user.posts.paginate(:page => params[:page]).order('created_at DESC')