app/controllers/ablums_controller.rb

  def index
    @ablums = Ablum.all
---
SELECT "ablums".* FROM "ablums"

  def create
    @ablum = Ablum.new(ablum_params)

    respond_to do |format|
      if @ablum.save
---
INSERT INTO "ablums" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "free", "publish", "text", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ablum.update(ablum_params)
---
UPDATE "ablums" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "ablums"."id" = 1

    def set_ablum
      @ablum = Ablum.find(params[:id])
---
SELECT "ablums".* FROM "ablums" WHERE "ablums"."id" = ? LIMIT 1  [["id", "1"]]