app/controllers/home_controller.rb

  def create


  	current_user.avatar = params[:avatar]
  	current_user.save
---
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["avatar", nil], ["updated_at", Fri, 04 Apr 2014 16:31:45 UTC +00:00]]