app/controllers/photos_controller.rb

INSERT INTO "photos" ("ablum_id", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "buyShow", "created_at", "is_conver", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

UPDATE "photos" SET "ablum_id" = ?, "updated_at" = ? WHERE "photos"."id" = 4  [["ablum_id", 1], ["updated_at", Thu, 17 Apr 2014 16:30:44 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)