app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.paginate(:page => params[:page])

INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 Apr 2014 16:28:10 UTC +00:00], ["text", "哦 我知道了"], ["title", "我说我想你了"], ["updated_at", Thu, 03 Apr 2014 16:28:10 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = 30  [["avatar_file_name", "back_ios7_2x.jpg"], ["avatar_file_size", 9751], ["avatar_updated_at", Sat, 05 Apr 2014 10:59:25 UTC +00:00], ["updated_at", Sat, 05 Apr 2014 10:59:25 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)